server/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."moniker" = ? LIMIT ?  [["moniker", "test"], ["LIMIT", 1]]
INSERT INTO "users" ("moniker", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["moniker", "test"], ["password_digest", "[FILTERED]"], ["created_at", "2023-02-13 02:57:00.798722"], ["updated_at", "2023-02-13 02:57:00.798722"]]
---
  def create
    user = User.find_by(moniker: user_params[:moniker])

    if user.nil?
      user = User.create(user_params)